<?php

require_once 'access.php';
require_once 'parts/functions.php';
require_once 'parts/functions_amo.php';
$connect_data['access_token'] = $access_token ;
$connect_data['subdomain'] = $subdomain;
 /******************************************************************************************************************
 *************  Создаем простую сделку **************************************************** 
 ********************************************************************************************************************/
echo "<br><br> Создаем простую сделку  ********************************************<br>";

$name_sdelka = "ООО «ИНВЕСТСТРОЙ»";
$link_to_change_kp = 'https://brazel.ru/?transition=30&id=3319';
$link_to_see_pdf = 'https://brazel.ru/EXCEL/%E2%84%96214%D0%95%20%D0%BE%D1%82%2017.03.2022%20%D0%9E%D0%9E%D0%9E%20%D0%A1%D0%A2%D0%A0%D0%9E%D0%99%D0%A2%D0%A0%D0%90%D0%9D%D0%A1%20(%D0%9A%D0%9F%20%D0%BA%20%D0%B7%D0%B0%D0%BA%D1%83%D0%BF%D0%BA%D0%B5%E2%84%9632211056310)%20%D0%9E%D0%9E%D0%9E%20%D0%A2%D0%94%20%D0%90%D0%9D%D0%9C%D0%90%D0%9A%D0%A1.pdf';
$price_sdelka = 5000000;

// формируем массив для созждания сделки
$data = Make_simple_sdelka ($name_sdelka, $link_to_change_kp, $link_to_see_pdf, $price_sdelka); 
// метод создания простой сдлеки
$method = "/api/v4/leads"; 
// запуск функции по созданию сделки в АМО
// $res = post_query_in_amo($access_token, $subdomain , $method , $data);
// $id_sdelka = $res["_embedded"]["leads"][0]["id"]; // ID созданной сделки

// $id_sdelka = 38842459;
 /******************************************************************************************************************
 *************************************  Редактирование стоимости сделки **************************************************** 
 ********************************************************************************************************************/

echo "<br><br> Редактирование стоимости сделки  ********************************************<br>";

$price_sdelka = 777777;
$method = "/api/v4/leads";  // метод редактирования сделки
$data = change_price_sdelka ($id_sdelka, $price_sdelka);
echo "<br><hr>";
// $res = send_patch_in_amo($access_token, $subdomain , $method , $data);

/******************************************************************************************************************
 *************************************  Создание компании   **************************************************** 
********************************************************************************************************************/
//// Создали компанию [id] => 68094105
echo "<br><br> Создание компании  ********************************************<br>";
$name_company = "Роги и копыта";
$method = "/api/v4/companies";  // метод редактирования сделки
$data_temp[]  =  array(
       "name" => "ООО Рога и Копыта",
       "custom_fields_values" => array (
           array(
               "field_code" => "PHONE",
               "values" => array(array(
                      "value" => "+79113222252",
                       "enum_code" => "WORK"
                             ))
           )
       )
   );

$data = json_encode($data_temp, JSON_UNESCAPED_UNICODE);
unset($data_temp);
// $res = post_query_in_amo($access_token, $subdomain , $method , $data);

$company_id = $res['_embedded']['companies'][0]['id']; // ID созданной компании

/******************************************************************************************************************
 *************************************  Привязка компании к сделке  **************************************************** 
********************************************************************************************************************/
echo "<br><br> Привязка компании к сделке  ********************************************<br>";
// $id_sdelka = 38842459;
// $company_id = 68094105;

unset($data_temp);
$data_temp =  array( array(   
       "to_entity_id" => $id_sdelka,
       "to_entity_type" => "leads"
      
   )
);


$data = json_encode($data_temp, JSON_UNESCAPED_UNICODE);

$method = "/api/v4/companies/".$company_id."/link";
// $res = post_query_in_amo($access_token, $subdomain , $method , $data);


 /******************************************************************************************************************
 *************************************  Редактирование стоимости сделки **************************************************** 
 ********************************************************************************************************************/

 echo "<br><br> Редактирование данных компании ********************************************<br>";


 $method = "/api/v4/companies";  // метод редактирования сделки
// $data = change_company_custom_fields_INN (68101263, "77278665123");
// $res = send_patch_in_amo($access_token, $subdomain , $method , $data);

$data = change_company_custom_fields_PHONE ($connect_data, 68101263, "+79125146541");
// $res = send_patch_in_amo($access_token, $subdomain , $method , $data);


 echo "<br><hr>";


 
$inn  = 77278665123;
 $res = find_company_by_inn ($connect_data, $inn);

 echo "<pre>";
 print_r($res);